# GetRibbonPanels Method (Tab)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ApplicationEntryPoint..::..GetRibbonPanels Method (Tab)
ApplicationEntryPoint Class See Also
---
**Namespace:** Autodesk.Revit.UI.Macros**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public override List<RibbonPanel> GetRibbonPanels(
	Tab tab
)
```

Visual Basic
---
```text
Public Overrides Function GetRibbonPanels ( _
	tab As Tab _
) As List(Of RibbonPanel)
```

Visual C++
---
```text
public:
virtual List<RibbonPanel^>^ GetRibbonPanels(
	Tab tab
) override
```

# ### Parameters
tab
    Type: Autodesk.Revit.UI..::..Tab
# See Also
ApplicationEntryPoint Class
GetRibbonPanels Overload
Autodesk.Revit.UI.Macros Namespace